## production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 4 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                               NAME                               |
|----------|------------------------------------------------------------------|
| update   | `aws_iam_policy.api`                                             |
|          | `aws_iam_policy.ecr`                                             |
|          | `aws_lambda_alias.api_latest`                                    |
|          | `aws_lambda_function.api`                                        |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]`                |
| add      | `aws_secretsmanager_secret.lambda-new-relic-license-key`         |
|          | `aws_secretsmanager_secret_version.lambda-new-relic-license-key` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:44:29.346 STDOUT terraform:   + create
17:44:29.346 STDOUT terraform:   ~ update in-place
17:44:29.346 STDOUT terraform: -/+ destroy and then create replacement
17:44:29.346 STDOUT terraform:  <= read (data resources)
17:44:29.346 STDOUT terraform: Terraform will perform the following actions:
17:44:29.346 STDOUT terraform:   # data.aws_iam_policy_document.api_policies will be read during apply
17:44:29.346 STDOUT terraform:   # (config refers to values not yet known)
17:44:29.346 STDOUT terraform:  <= data "aws_iam_policy_document" "api_policies" {
17:44:29.346 STDOUT terraform:       + id            = (known after apply)
17:44:29.346 STDOUT terraform:       + json          = (known after apply)
17:44:29.346 STDOUT terraform:       + minified_json = (known after apply)
17:44:29.346 STDOUT terraform:       + statement {
17:44:29.346 STDOUT terraform:           + actions   = [
17:44:29.346 STDOUT terraform:               + "logs:CreateLogStream",
17:44:29.346 STDOUT terraform:               + "logs:PutLogEvents",
17:44:29.346 STDOUT terraform:             ]
17:44:29.346 STDOUT terraform:           + effect    = "Allow"
17:44:29.346 STDOUT terraform:           + resources = [
17:44:29.346 STDOUT terraform:               + "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:         }
17:44:29.347 STDOUT terraform:       + statement {
17:44:29.347 STDOUT terraform:           + actions   = [
17:44:29.347 STDOUT terraform:               + "ecr:BatchGetImage",
17:44:29.347 STDOUT terraform:               + "ecr:GetDownloadUrlForlayer",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:           + effect    = "Allow"
17:44:29.347 STDOUT terraform:           + resources = [
17:44:29.347 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:         }
17:44:29.347 STDOUT terraform:       + statement {
17:44:29.347 STDOUT terraform:           + actions   = [
17:44:29.347 STDOUT terraform:               + "s3:*",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:           + effect    = "Allow"
17:44:29.347 STDOUT terraform:           + resources = [
17:44:29.347 STDOUT terraform:               + "arn:aws:s3:::notification-canada-ca-production-csv-upload/*",
17:44:29.347 STDOUT terraform:               + "arn:aws:s3:::notification-canada-ca-production-gc-organisations/*",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:         }
17:44:29.347 STDOUT terraform:       + statement {
17:44:29.347 STDOUT terraform:           + actions   = [
17:44:29.347 STDOUT terraform:               + "securityhub:BatchImportFindings",
17:44:29.347 STDOUT terraform:               + "sns:Publish",
17:44:29.347 STDOUT terraform:               + "sqs:*",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:           + effect    = "Allow"
17:44:29.347 STDOUT terraform:           + resources = [
17:44:29.347 STDOUT terraform:               + "*",
17:44:29.347 STDOUT terraform:             ]
17:44:29.347 STDOUT terraform:         }
17:44:29.347 STDOUT terraform:       + statement {
17:44:29.347 STDOUT terraform:           + actions   = [
17:44:29.348 STDOUT terraform:               + "ssm:DescribeParameters",
17:44:29.348 STDOUT terraform:             ]
17:44:29.348 STDOUT terraform:           + effect    = "Allow"
17:44:29.348 STDOUT terraform:           + resources = [
17:44:29.348 STDOUT terraform:               + "*",
17:44:29.348 STDOUT terraform:             ]
17:44:29.348 STDOUT terraform:         }
17:44:29.348 STDOUT terraform:       + statement {
17:44:29.348 STDOUT terraform:           + actions   = [
17:44:29.348 STDOUT terraform:               + "ssm:GetParameters",
17:44:29.348 STDOUT terraform:             ]
17:44:29.348 STDOUT terraform:           + effect    = "Allow"
17:44:29.348 STDOUT terraform:           + resources = (sensitive value)
17:44:29.348 STDOUT terraform:         }
17:44:29.348 STDOUT terraform:       + statement {
17:44:29.348 STDOUT terraform:           + actions   = [
17:44:29.348 STDOUT terraform:               + "secretsmanager:GetSecretValue",
17:44:29.348 STDOUT terraform:             ]
17:44:29.348 STDOUT terraform:           + effect    = "Allow"
17:44:29.348 STDOUT terraform:           + resources = [
17:44:29.348 STDOUT terraform:               + "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1",
17:44:29.348 STDOUT terraform:               + (known after apply),
17:44:29.348 STDOUT terraform:             ]
17:44:29.348 STDOUT terraform:         }
17:44:29.348 STDOUT terraform:       + statement {
17:44:29.348 STDOUT terraform:           + actions   = [
17:44:29.348 STDOUT terraform:               + "cloudwatch:GetMetricData",
17:44:29.348 STDOUT terraform:               + "cloudwatch:GetMetricStatistics",
17:44:29.348 STDOUT terraform:               + "cloudwatch:ListMetrics",
17:44:29.348 STDOUT terraform:               + "config:BatchGetResourceConfig",
17:44:29.348 STDOUT terraform:               + "config:ListDiscoveredResources",
17:44:29.348 STDOUT terraform:               + "lambda:GetAccountSettings",
17:44:29.348 STDOUT terraform:               + "lambda:ListAliases",
17:44:29.348 STDOUT terraform:               + "lambda:ListEventSourceMappings",
17:44:29.348 STDOUT terraform:               + "lambda:ListFunctions",
17:44:29.349 STDOUT terraform:               + "lambda:ListTags",
17:44:29.349 STDOUT terraform:               + "tag:GetResources",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:           + effect    = "Allow"
17:44:29.349 STDOUT terraform:           + resources = [
17:44:29.349 STDOUT terraform:               + "*",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:         }
17:44:29.349 STDOUT terraform:       + statement {
17:44:29.349 STDOUT terraform:           + actions   = [
17:44:29.349 STDOUT terraform:               + "xray:PutTelemetryRecords",
17:44:29.349 STDOUT terraform:               + "xray:PutTraceSegments",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:           + effect    = "Allow"
17:44:29.349 STDOUT terraform:           + resources = [
17:44:29.349 STDOUT terraform:               + "*",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:         }
17:44:29.349 STDOUT terraform:     }
17:44:29.349 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
17:44:29.349 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:44:29.349 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
17:44:29.349 STDOUT terraform:       + id            = (known after apply)
17:44:29.349 STDOUT terraform:       + json          = (known after apply)
17:44:29.349 STDOUT terraform:       + minified_json = (known after apply)
17:44:29.349 STDOUT terraform:       + statement {
17:44:29.349 STDOUT terraform:           + actions   = [
17:44:29.349 STDOUT terraform:               + "ecr:GetAuthorizationToken",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:           + effect    = "Allow"
17:44:29.349 STDOUT terraform:           + resources = [
17:44:29.349 STDOUT terraform:               + "*",
17:44:29.349 STDOUT terraform:             ]
17:44:29.349 STDOUT terraform:           + sid       = "GetAuthorizationToken"
17:44:29.349 STDOUT terraform:         }
17:44:29.349 STDOUT terraform:       + statement {
17:44:29.349 STDOUT terraform:           + actions   = [
17:44:29.349 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
17:44:29.349 STDOUT terraform:               + "ecr:BatchGetImage",
17:44:29.350 STDOUT terraform:               + "ecr:CompleteLayerUpload",
17:44:29.350 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
17:44:29.350 STDOUT terraform:               + "ecr:InitiateLayerUpload",
17:44:29.350 STDOUT terraform:               + "ecr:PutImage",
17:44:29.350 STDOUT terraform:               + "ecr:UploadLayerPart",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + effect    = "Allow"
17:44:29.350 STDOUT terraform:           + resources = [
17:44:29.350 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + sid       = "AllowPushPull"
17:44:29.350 STDOUT terraform:         }
17:44:29.350 STDOUT terraform:       + statement {
17:44:29.350 STDOUT terraform:           + actions   = [
17:44:29.350 STDOUT terraform:               + "lambda:GetAlias",
17:44:29.350 STDOUT terraform:               + "lambda:GetFunction",
17:44:29.350 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
17:44:29.350 STDOUT terraform:               + "lambda:ListAliases",
17:44:29.350 STDOUT terraform:               + "lambda:ListVersionsByFunction",
17:44:29.350 STDOUT terraform:               + "lambda:PublishVersion",
17:44:29.350 STDOUT terraform:               + "lambda:UpdateAlias",
17:44:29.350 STDOUT terraform:               + "lambda:UpdateFunctionCode",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + effect    = "Allow"
17:44:29.350 STDOUT terraform:           + resources = [
17:44:29.350 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
17:44:29.350 STDOUT terraform:         }
17:44:29.350 STDOUT terraform:       + statement {
17:44:29.350 STDOUT terraform:           + actions   = [
17:44:29.350 STDOUT terraform:               + "lambda:GetLayerVersion",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + effect    = "Allow"
17:44:29.350 STDOUT terraform:           + resources = [
17:44:29.350 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
17:44:29.350 STDOUT terraform:             ]
17:44:29.350 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
17:44:29.350 STDOUT terraform:         }
17:44:29.350 STDOUT terraform:     }
17:44:29.350 STDOUT terraform:   # aws_iam_policy.api will be updated in-place
17:44:29.350 STDOUT terraform:   ~ resource "aws_iam_policy" "api" {
17:44:29.350 STDOUT terraform:         id               = "arn:aws:iam::296255494825:policy/notify-api"
17:44:29.350 STDOUT terraform:         name             = "notify-api"
17:44:29.350 STDOUT terraform:       ~ policy           = jsonencode(
17:44:29.350 STDOUT terraform:             {
17:44:29.350 STDOUT terraform:               - Statement = [
17:44:29.350 STDOUT terraform:                   - {
17:44:29.350 STDOUT terraform:                       - Action   = [
17:44:29.350 STDOUT terraform:                           - "logs:PutLogEvents",
17:44:29.350 STDOUT terraform:                           - "logs:CreateLogStream",
17:44:29.350 STDOUT terraform:                         ]
17:44:29.350 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:api_gateway_log_group"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = [
17:44:29.351 STDOUT terraform:                           - "ecr:GetDownloadUrlForlayer",
17:44:29.351 STDOUT terraform:                           - "ecr:BatchGetImage",
17:44:29.351 STDOUT terraform:                         ]
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = "s3:*"
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = [
17:44:29.351 STDOUT terraform:                           - "arn:aws:s3:::notification-canada-ca-production-gc-organisations/*",
17:44:29.351 STDOUT terraform:                           - "arn:aws:s3:::notification-canada-ca-production-csv-upload/*",
17:44:29.351 STDOUT terraform:                         ]
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = [
17:44:29.351 STDOUT terraform:                           - "sqs:*",
17:44:29.351 STDOUT terraform:                           - "sns:Publish",
17:44:29.351 STDOUT terraform:                           - "securityhub:BatchImportFindings",
17:44:29.351 STDOUT terraform:                         ]
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "*"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = "ssm:DescribeParameters"
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "*"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = "ssm:GetParameters"
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/ENVIRONMENT_VARIABLES"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = "secretsmanager:GetSecretValue"
17:44:29.351 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.351 STDOUT terraform:                       - Resource = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:NEW_RELIC_LICENSE_KEY-3VIjR1"
17:44:29.351 STDOUT terraform:                     },
17:44:29.351 STDOUT terraform:                   - {
17:44:29.351 STDOUT terraform:                       - Action   = [
17:44:29.351 STDOUT terraform:                           - "tag:GetResources",
17:44:29.351 STDOUT terraform:                           - "lambda:ListTags",
17:44:29.352 STDOUT terraform:                           - "lambda:ListFunctions",
17:44:29.352 STDOUT terraform:                           - "lambda:ListEventSourceMappings",
17:44:29.352 STDOUT terraform:                           - "lambda:ListAliases",
17:44:29.352 STDOUT terraform:                           - "lambda:GetAccountSettings",
17:44:29.352 STDOUT terraform:                           - "config:ListDiscoveredResources",
17:44:29.352 STDOUT terraform:                           - "config:BatchGetResourceConfig",
17:44:29.352 STDOUT terraform:                           - "cloudwatch:ListMetrics",
17:44:29.352 STDOUT terraform:                           - "cloudwatch:GetMetricStatistics",
17:44:29.352 STDOUT terraform:                           - "cloudwatch:GetMetricData",
17:44:29.352 STDOUT terraform:                         ]
17:44:29.352 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.352 STDOUT terraform:                       - Resource = "*"
17:44:29.352 STDOUT terraform:                     },
17:44:29.352 STDOUT terraform:                   - {
17:44:29.352 STDOUT terraform:                       - Action   = [
17:44:29.352 STDOUT terraform:                           - "xray:PutTraceSegments",
17:44:29.352 STDOUT terraform:                           - "xray:PutTelemetryRecords",
17:44:29.352 STDOUT terraform:                         ]
17:44:29.352 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.352 STDOUT terraform:                       - Resource = "*"
17:44:29.352 STDOUT terraform:                     },
17:44:29.352 STDOUT terraform:                 ]
17:44:29.352 STDOUT terraform:               - Version   = "2012-10-17"
17:44:29.352 STDOUT terraform:             }
17:44:29.352 STDOUT terraform:         ) -> (known after apply)
17:44:29.352 STDOUT terraform:         tags             = {}
17:44:29.352 STDOUT terraform:         # (7 unchanged attributes hidden)
17:44:29.352 STDOUT terraform:     }
17:44:29.352 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
17:44:29.352 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
17:44:29.352 STDOUT terraform:         id               = "arn:aws:iam::296255494825:policy/ecr-api-lambda-access"
17:44:29.352 STDOUT terraform:         name             = "ecr-api-lambda-access"
17:44:29.352 STDOUT terraform:       ~ policy           = jsonencode(
17:44:29.352 STDOUT terraform:             {
17:44:29.352 STDOUT terraform:               - Statement = [
17:44:29.352 STDOUT terraform:                   - {
17:44:29.352 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
17:44:29.352 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.352 STDOUT terraform:                       - Resource = "*"
17:44:29.352 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
17:44:29.352 STDOUT terraform:                     },
17:44:29.352 STDOUT terraform:                   - {
17:44:29.352 STDOUT terraform:                       - Action   = [
17:44:29.352 STDOUT terraform:                           - "ecr:UploadLayerPart",
17:44:29.352 STDOUT terraform:                           - "ecr:PutImage",
17:44:29.352 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
17:44:29.352 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
17:44:29.352 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
17:44:29.352 STDOUT terraform:                           - "ecr:BatchGetImage",
17:44:29.352 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
17:44:29.352 STDOUT terraform:                         ]
17:44:29.352 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.352 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda"
17:44:29.353 STDOUT terraform:                       - Sid      = "AllowPushPull"
17:44:29.353 STDOUT terraform:                     },
17:44:29.353 STDOUT terraform:                   - {
17:44:29.353 STDOUT terraform:                       - Action   = [
17:44:29.353 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
17:44:29.353 STDOUT terraform:                           - "lambda:UpdateAlias",
17:44:29.353 STDOUT terraform:                           - "lambda:PublishVersion",
17:44:29.353 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
17:44:29.353 STDOUT terraform:                           - "lambda:ListAliases",
17:44:29.353 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
17:44:29.353 STDOUT terraform:                           - "lambda:GetFunction",
17:44:29.353 STDOUT terraform:                           - "lambda:GetAlias",
17:44:29.353 STDOUT terraform:                         ]
17:44:29.353 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.353 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda"
17:44:29.353 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
17:44:29.353 STDOUT terraform:                     },
17:44:29.353 STDOUT terraform:                   - {
17:44:29.353 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
17:44:29.353 STDOUT terraform:                       - Effect   = "Allow"
17:44:29.353 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
17:44:29.353 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
17:44:29.353 STDOUT terraform:                     },
17:44:29.353 STDOUT terraform:                 ]
17:44:29.353 STDOUT terraform:               - Version   = "2012-10-17"
17:44:29.353 STDOUT terraform:             }
17:44:29.353 STDOUT terraform:         ) -> (known after apply)
17:44:29.353 STDOUT terraform:         tags             = {}
17:44:29.353 STDOUT terraform:         # (7 unchanged attributes hidden)
17:44:29.353 STDOUT terraform:     }
17:44:29.353 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
17:44:29.353 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
17:44:29.353 STDOUT terraform:       ~ function_version = "682" -> (known after apply)
17:44:29.353 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:latest"
17:44:29.353 STDOUT terraform:         name             = "latest"
17:44:29.353 STDOUT terraform:         # (5 unchanged attributes hidden)
17:44:29.353 STDOUT terraform:     }
17:44:29.353 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
17:44:29.353 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
17:44:29.353 STDOUT terraform:         id                             = "api-lambda"
17:44:29.353 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:682" -> (known after apply)
17:44:29.353 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:682/invocations" -> (known after apply)
17:44:29.353 STDOUT terraform:         tags                           = {}
17:44:29.354 STDOUT terraform:       ~ version                        = "682" -> (known after apply)
17:44:29.354 STDOUT terraform:         # (27 unchanged attributes hidden)
17:44:29.354 STDOUT terraform:       ~ environment {
17:44:29.354 STDOUT terraform:           ~ variables = {
17:44:29.354 STDOUT terraform:               - "NEW_RELIC_CONFIG_FILE"                  = "/app/newrelic.ini" -> null
17:44:29.354 STDOUT terraform:               ~ "NEW_RELIC_DISTRIBUTED_TRACING_ENABLED"  = "true" -> "false"
17:44:29.354 STDOUT terraform:               ~ "NEW_RELIC_EXTENSION_LOGS_ENABLED"       = "true" -> "false"
17:44:29.354 STDOUT terraform:               + "NEW_RELIC_EXTENSION_SEND_FUNCTION_LOGS" = "false"
17:44:29.354 STDOUT terraform:               ~ "NEW_RELIC_LAMBDA_EXTENSION_ENABLED"     = "true" -> "false"
17:44:29.354 STDOUT terraform:               + "NEW_RELIC_LICENSE_KEY_SECRET"           = "NEW_RELIC_LICENSE_KEY"
17:44:29.354 STDOUT terraform:                 # (15 unchanged elements hidden)
17:44:29.354 STDOUT terraform:             }
17:44:29.354 STDOUT terraform:         }
17:44:29.354 STDOUT terraform:         # (4 unchanged blocks hidden)
17:44:29.354 STDOUT terraform:     }
17:44:29.354 STDOUT terraform:   # aws_secretsmanager_secret.lambda-new-relic-license-key will be created
17:44:29.354 STDOUT terraform:   + resource "aws_secretsmanager_secret" "lambda-new-relic-license-key" {
17:44:29.354 STDOUT terraform:       + arn                            = (known after apply)
17:44:29.354 STDOUT terraform:       + description                    = "The New Relic license key, for sending telemetry"
17:44:29.354 STDOUT terraform:       + force_overwrite_replica_secret = false
17:44:29.354 STDOUT terraform:       + id                             = (known after apply)
17:44:29.354 STDOUT terraform:       + name                           = "LAMBDA_NEW_RELIC_LICENSE_KEY"
17:44:29.354 STDOUT terraform:       + name_prefix                    = (known after apply)
17:44:29.354 STDOUT terraform:       + policy                         = (known after apply)
17:44:29.354 STDOUT terraform:       + recovery_window_in_days        = 0
17:44:29.354 STDOUT terraform:       + region                         = "ca-central-1"
17:44:29.354 STDOUT terraform:       + tags_all                       = (known after apply)
17:44:29.354 STDOUT terraform:       + replica (known after apply)
17:44:29.354 STDOUT terraform:     }
17:44:29.354 STDOUT terraform:   # aws_secretsmanager_secret_version.lambda-new-relic-license-key will be created
17:44:29.354 STDOUT terraform:   + resource "aws_secretsmanager_secret_version" "lambda-new-relic-license-key" {
17:44:29.354 STDOUT terraform:       + arn                  = (known after apply)
17:44:29.354 STDOUT terraform:       + has_secret_string_wo = (known after apply)
17:44:29.354 STDOUT terraform:       + id                   = (known after apply)
17:44:29.354 STDOUT terraform:       + region               = "ca-central-1"
17:44:29.354 STDOUT terraform:       + secret_id            = (known after apply)
17:44:29.354 STDOUT terraform:       + secret_string        = (sensitive value)
17:44:29.354 STDOUT terraform:       + secret_string_wo     = (write-only attribute)
17:44:29.354 STDOUT terraform:       + version_id           = (known after apply)
17:44:29.354 STDOUT terraform:       + version_stages       = (known after apply)
17:44:29.354 STDOUT terraform:     }
17:44:29.354 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
17:44:29.355 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
17:44:29.355 STDOUT terraform:       ~ id       = "2540824286117733822" -> (known after apply)
17:44:29.355 STDOUT terraform:       ~ triggers = { # forces replacement
17:44:29.355 STDOUT terraform:           ~ "always_run" = "2025-10-01T15:58:34Z" -> (known after apply)
17:44:29.355 STDOUT terraform:         }
17:44:29.355 STDOUT terraform:     }
17:44:29.355 STDOUT terraform: Plan: 3 to add, 4 to change, 1 to destroy.
17:44:29.355 STDOUT terraform: Warning: Argument is deprecated
17:44:29.355 STDOUT terraform:   with module.signoz_api_lambda_logs.aws_s3_bucket.this,
17:44:29.355 STDOUT terraform:   on .terraform/modules/signoz_api_lambda_logs/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
17:44:29.355 STDOUT terraform:    8: resource "aws_s3_bucket" "this" {
17:44:29.355 STDOUT terraform: server_side_encryption_configuration is deprecated. Use the
17:44:29.355 STDOUT terraform: aws_s3_bucket_server_side_encryption_configuration resource instead.
17:44:29.355 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:44:29.355 STDOUT terraform: Saved the plan to: plan.tfplan
17:44:29.355 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:44:29.355 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
